app/controllers/groups_controller.rb

SELECT "group_payments".* FROM "group_payments" WHERE "group_payments"."group_id" IN ($1, $2)  [["group_id", 1], ["group_id", 2]]
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
SELECT SUM("payments"."amount") FROM "payments" INNER JOIN "group_payments" ON "payments"."id" = "group_payments"."payment_id" WHERE "group_payments"."group_id" = $1  [["group_id", 1]]
SELECT "payments".* FROM "payments" INNER JOIN "group_payments" ON "payments"."id" = "group_payments"."payment_id" WHERE "group_payments"."group_id" = $1  [["group_id", 1]]
---
  def index
    @user = current_user
    @groups = Group.where(user_id: @user.id).includes(:group_payments)
    @total_user_amount = @groups.flat_map(&:payments).sum(&:amount)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "payments".* FROM "payments" INNER JOIN "group_payments" ON "payments"."id" = "group_payments"."payment_id" WHERE "group_payments"."group_id" = $1 ORDER BY "payments"."created_at" DESC  [["group_id", 1]]
---
  def show
    @group = Group.find(params[:id])
    @payments = @group.payments.order(created_at: :desc)

INSERT INTO "groups" ("name", "icon", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "food"], ["icon", "https://cdn-icons-png.flaticon.com/512/3514/3514424.png"], ["created_at", "2023-04-08 07:45:17.503981"], ["updated_at", "2023-04-08 07:45:17.503981"], ["user_id", 1]]
---
  def create
    @group = current_user.groups.build(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "icon" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["icon", "https://cdn-icons-png.flaticon.com/512/2123/2123703.png"], ["updated_at", "2023-04-08 11:31:48.062723"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_group
    @group = Group.find(params[:id])